let who = `<p>Ο Δομήνικος Θεοτοκόπουλος (Ηράκλειο Κρήτης, 1 Οκτωβρίου 1541 – Τολέδο, 7 Απριλίου 1614), 
γνωστός επίσης με τo ισπανικό προσωνύμιο El Greco, που σημαίνει Ο Έλληνας, ήταν Κρητικός ζωγράφος, 
γλύπτης και αρχιτέκτονας της ισπανικής Αναγέννησης. Έζησε το μεγαλύτερο μέρος της ζωής του μακριά από την Ελλάδα, 
δημιουργώντας τα περισσότερα έργα του στην Ιταλία και στην Ισπανία. Εκπαιδεύτηκε αρχικά ως αγιογράφος στο Ηράκλειο,
που αποτελούσε τότε τμήμα της ενετικής επικράτειας, και αργότερα ταξίδεψε στη Βενετία. Στην Ιταλία επηρεάστηκε από τους μεγαλύτερους δασκάλους της ιταλικής τέχνης, 
όπως τον Τιντορέττο και τον Τιτσιάνο, του οποίου υπήρξε μαθητής, υιοθετώντας στοιχεία από τον μανιερισμό. Το 1577 εγκαταστάθηκε στο Τολέδο, όπου έζησε μέχρι το τέλος της ζωής του και ολοκλήρωσε 
ορισμένα από τα πιο γνωστά έργα του. Υφολογικά, η τεχνοτροπία του Ελ Γκρέκο θεωρείται έκφραση της Βενετικής Σχολής και του μανιερισμού όπως αυτός διαμορφώθηκε στο δεύτερο μισό του 16ου αιώνα. 
Παράλληλα χαρακτηρίζεται από προσωπικά στοιχεία, προϊόντα της τάσης του για πρωτοτυπία, τα οποία όμως δεν βρήκαν μιμητές στην εποχή του, γεγονός που δεν ευνόησε και τη συνέχειά τους. Η μπαρόκ τεχνοτροπία που 
εκτόπισε τον μανιερισμό, αλλά και τα αμέσως μεταγενέστερα καλλιτεχνικά ρεύματα που δεν αντιμετώπισαν ευμενώς το ύφος του και είχαν ως αποτέλεσμα να αγνοηθεί το έργο του Γκρέκο τους επόμενους αιώνες. Στη διάρκεια του 20ού αιώνα, 
αναγνωρίστηκε ως πρόδρομος της μοντέρνας τέχνης που αξιοποίησε στοιχεία της Ανατολικής και Δυτικής παράδοσης, και το έργο του επανεκτιμήθηκε, διατηρώντας μέχρι σήμερα δεσπόζουσα θέση ανάμεσα στους μείζονες ζωγράφους όλων των εποχών.</p>`;

document.getElementById('who').addEventListener('click', function() {
    document.getElementById("main").innerHTML = who;
});

let newyears = `<p>Ο Δομήνικος Θεοτοκόπουλος γεννήθηκε πιθανότατα το 1541 στον Χάνδακα,[ii] το σημερινό Ηράκλειο της Κρήτης, 
την εποχή της Βενετοκρατίας. Η ημερομηνία γέννησης του προκύπτει όχι από κάποιο επίσημο έγγραφο της εποχής αλλά με βάση μία 
ιδιόχειρη σημείωση του, σύμφωνα με την οποία το 1606 ήταν 65 ετών. Ο πατέρας του, Γεώργιος Θεοτοκόπουλος, ήταν φοροσυλλέκτης 
και έμπορος. Για τη μητέρα του δεν υπάρχουν πληροφορίες, ενώ άγνωστη παραμένει και η ταυτότητα μίας ενδεχόμενης πρώτης, Ελληνίδας συζύγου του. 
Είχε έναν μεγαλύτερο αδελφό, τον Μανούσο Θεοτοκόπουλο (1531-1604), ο οποίος ακολούθησε το επάγγελμα του πατέρα τους. Ο Θεοτοκόπουλος εκπαιδεύτηκε ως Αγιογράφος, 
γεγονός που πιστοποιείται από ένα δημόσιο έγγραφο του 1563, ενώ θα πρέπει να μελέτησε από νεαρή ηλικία την αρχαία ελληνική και κλασική γραμματεία, κρίνοντας από 
την πλούσια βιβλιοθήκη[iii] που κληροδότησε μετά τον θάνατό του, ο υιός του.[17] Το όνομα του πρώτου δασκάλου του δεν είναι γνωστό, αν και το όνομα του Ιωάννη Γριπιώτη (1516-1569) έχει προταθεί.
[16] Στην Κρήτη, που από το 1211 αποτελούσε μέρος της ενετικής επικράτειας, οι ζωγράφοι και οι αγιογράφοι συνδύαζαν το βυζαντινό ιδίωμα με τις Δυτικές επιρροές, φιλοτεχνώντας φορητές κυρίως εικόνες και διαμορφώνοντας τη λεγόμενη Κρητική Σχολή. 
Στον Χάνδακα εργάζονταν κατά τον 16ο αιώνα περίπου διακόσιοι ζωγράφοι, οργανωμένοι σε συντεχνίες σύμφωνα με τα ιταλικά πρότυπα. Ο Θεοτοκόπουλος εξοικειώθηκε από νωρίς με έργα καλλιτεχνών της Αναγέννησης που κυκλοφορούσαν στη βενετοκρατούμενη Κρήτη και 
από το 1563 εξασκούσε επίσημα το επάγγελμα του ζωγράφου. Η πληροφορία αυτή εκμαιεύεται από μία αναφορά στο όνομά του σε επίσημο έγγραφο της εποχής, στην οποία περιγράφεται ως δάσκαλος (maestro Domenigo).[18] Μία από τις πρώτες πληροφορίες που διαθέτουμε 
για κάποιο έργο του προέρχεται επίσης από άλλο έγγραφο του 1566, σύμφωνα με το οποίο δόθηκε στον Θεοτοκόπουλο άδεια για να πουλήσει με λαχνό μία εικόνα που εκτιμήθηκε στα 70 δουκάτα, ποσό ιδιαίτερα σημαντικό για την εποχή και ειδικότερα για έναν νέο καλλιτέχνη.[19][20]
 Με δεδομένο πως στην εποχή του συνυπήρχαν στην Κρήτη Ορθόδοξοι και Καθολικοί, παραμένει αμφιλεγόμενο σε ποιο από τα δόγματα αυτά ανήκε η οικογένειά του. Θεωρείται πιθανότερο πως ήταν ορθόδοξη,[20] εκδοχή που στηρίζεται σε μελέτες αρχειακών και νομικών εγγράφων, σύμφωνα 
 με τις οποίες ένας θείος του ήταν ορθόδοξος ιερέας, ενώ το όνομα του Δομήνικου Θεοτοκόπουλου δεν καταγράφεται στα αρχεία των βαφτίσεων της Καθολικής Εκκλησίας στην Κρήτη.[17] Διαφορετικές πηγές κάνουν επίσης λόγο για πιθανή καταγωγή του από καθολική οικογένεια.[16] Ορισμένοι 
 μελετητές εκτιμούν πως ο Θεοτοκόπουλος ασπάστηκε αργότερα το καθολικό δόγμα, λαμβάνοντας υπόψη τη διαθήκη του, στην οποία ανέφερε πως υπήρξε «πιστός Καθολικός». Η διαθήκη αυτή έχει αμφισβητηθεί, συνυπολογίζοντας την υποχρέωσή του να τη συντάξει σύμφωνα με τις επιταγές της Ιεράς Εξέτασης.</p>`;

document.getElementById('newyears').addEventListener('click', function() {
    document.getElementById("main").innerHTML = newyears;
});

let italy = ` <p>Με δεδομένο πως η Κρήτη ανήκε στην επικράτεια της Δημοκρατίας της Βενετίας, 
ήταν φυσιολογική η εγκατάστασή του στη Βενετία για τη συνέχιση των σπουδών του. Η ακριβής χρονολογία 
άφιξής του δεν είναι γνωστή, ωστόσο εκτιμάται πως εγκατέλειψε την Κρήτη το 1567.[iv] Έζησε στη Βενετία 
περίπου μέχρι το 1570 επιχειρώντας να ακολουθήσει τα πρότυπα των καλλιτεχνών που κυριαρχούσαν στην καλλιτεχνική 
ζωή της πόλης, μεταξύ αυτών ο Τιτσιάνο και ο Τιντορέττο. Την ίδια περίοδο υιοθέτησε την τεχνική της ελαιογραφίας,
 ζωγραφίζοντας πλέον σε μουσαμά και εγκαταλείποντας το ξύλο. Ένα από τα έργα που αποτυπώνουν τη μετάβαση του Θεοτοκόπουλου
  από το Βυζαντινό στο Δυτικό ιδίωμα είναι το Τρίπτυχο της Μοντένα (π. 1560-1565), το οποίο περιλαμβάνει στοιχεία εμφανώς 
  εμπνευσμένα από τα πρότυπα που κυριαρχούσαν στην Ιταλία, συνυφασμένα με θέματα επηρεασμένα από την ελληνορωμαϊκή αρχαιότητα.[22] 
  Προσωπογραφία του Τζούλιο Κλόβιο, λάδι σε μουσαμά, 58x56 εκ., Νάπολη, Εθνικό Μουσείο Καποντιμόντε Τρίπτυχο της Μόντενα 
  (κύρια όψη), περ. 1560-65, Τέμπερα σε ξύλο, 37 x 23,8 εκ. (μεσαίο φύλλο), 24 x 18 εκ. (πλάγια φύλλα), Μόντενα, Γκαλέρια Εστένσε.
   Το τρίπτυχο περιείχε στην κύρια όψη τρεις σκηνές, τη Στέψη του χριστιανού ιππότη, την Προσκύνηση των ποιμένων και τη Βάπτιση του 
   Χριστού. Στην πίσω όψη ο Γκρέκο φιλοτέχνησε μία Άποψη του Όρους Σινά (παραλλαγή χαρακτικού του Giovanni Battista Fontana), 
   τον Ευαγγελισμό και την Επίπληξη προς τον Αδάμ και την Εύα. Τα τοπία που ζωγράφισε πάνω στο ξύλο με φωτεινά χρώματα 
   παραπέμπουν σε έργα των Βενετσιάνων Δασκάλων. Το 1570 βρέθηκε στη Ρώμη, γεγονός που μας αποκαλύπτεται από σχετική 
   επιστολή του ζωγράφου Τζούλιο Κλόβιο, μέσα από την οποία συστήνει τον Θεοτoκόπουλο στον προστάτη του, καρδινάλιο 
   Αλεσάντρο Φαρνέζε, περιγράφοντάς τον ως έναν «νεαρό από τον Χάνδακα, μαθητή του Τιτσιάνο» και «σπάνιο ταλέντο 
   στη ζωγραφική».[23] Πιθανά προκειμένου να ανταποδώσει την εξυπηρέτηση, ο Ελ Γκρέκο δημιούργησε μία ημίσωμη 
   προσωπογραφία του Κλόβιο, η οποία αποτελεί και την παλαιότερη προσωπογραφία του που διασώζεται μέχρι σήμερα. 
   Στη Ρώμη, ο Θεοτοκόπουλος, όπως και άλλοι διακεκριμένοι ζωγράφοι, ήρθε αντιμέτωπος με τον σκληρό 
   ανταγωνισμό που επικρατούσε την εποχή εκείνη, την ίδια στιγμή που δέσποζε η παρουσία του Τιτσιάνο και εξακολουθούσε
    να ασκεί επίδραση το έργο του Μιχαήλ Άγγελου, έξι χρόνια μετά τον θάνατό του. Η σχέση του Γκρέκο με το έργο του 
    τελευταίου παραμένει αμφιλεγόμενη. Σύμφωνα με μία ανεκδοτολογική αναφορά που δεν επιβεβαιώνεται, 
    πρότεινε στον πάπα Πίο Ε' να φιλοτεχνήσει πάνω στη Δευτέρα Παρουσία του Μιχαήλ Άγγελου, έργο με το οποίο 
    είχε διακοσμήσει την Καπέλα Σιξτίνα.[24] Όταν αργότερα του ζητήθηκε να εκφέρει την άποψή του για τον Μιχαήλ Άγγελο
    , ο Θεοτοκόπουλος απάντησε πως τον θεωρούσε έναν καλό άνθρωπο, ο οποίος όμως δεν γνώριζε να ζωγραφίζει.[25] Ο Φρανθίσκο Πατσέκο 
    επίσης αναφέρει δυσμενή σχόλια του Γκρέκο για τον Μιχαήλ Άγγελο, κατά τη διάρκεια συνάντησής τους στο Τολέδο, λίγο πριν τον 
    θάνατο του.[26] Από την άλλη πλευρά, η επίδραση που του άσκησε θεωρείται δεδομένη. Οι προσωπογραφίες των Τιτσιάνο, Μιχαήλ Άγγελου,
     Κλόβιο και Ραφαήλ που φιλοτέχνησε στο έργο Η εκδίωξη των εμπόρων, έχουν ερμηνευτεί ως επιθυμία του να αποδώσει ένα φόρο τιμής σε αυτούς, 
     αναγνωρίζοντας με τον τρόπο αυτό την αξία τους.[24] Φαίνεται ωστόσο πως ο Γκρέκο έδειξε μεγαλύτερο ενδιαφέρον στον δυναμισμό του 
     Κορέτζιο και την κομψότητα των έργων του Παρμιτζανίνο.[16][27] Στο Παλάτσο Φαρνέζε γνώρισε τον ουμανιστή βιβλιοθηκάριο του Φαρνέζε,
      Φούλβιο Ορσίνι, ο οποίος υπήρξε υποστηρικτής του Γκρέκο και στη συλλογή του βρέθηκαν αργότερα επτά έργα του. 
      Δουλεύοντας στην υπηρεσία του Αλεσάντρο Φαρνέζε, δεν είχε σημαντικές ευκαιρίες να αναδείξει το ταλέντο του και 
      ανέλαβε τελικά λίγες παραγγελίες. Το 1572 αποπέμφθηκε τελικά από το Παλάτσο Φαρνέζε, γεγονός που πιστοποιείται από μία επιστολή 
      του Θεοτοκόπουλου, με ημερομηνία 6 Ιουλίου 1572, στην οποία διαμαρτύρεται για την άδικη εκδίωξή του από το παλάτι. Στις 18 Σεπτεμβρίου της ίδιας χρονιάς, 
      κατέθεσε αίτηση για να γίνει μέλος της συντεχνίας ζωγράφων του Αγίου Λουκά, με το όνομα Domenico Greco, αποφασίζοντας προφανώς να ακολουθήσει 
      σταδιοδρομία ανεξάρτητου και αυτόνομου καλλιτέχνη. Συνολικά, οι πίνακες που φιλοτέχνησε στην Ιταλία ακολούθησαν τα αναγεννησιακά πρότυπα του 16ου αιώνα στη Βενετία,
      [28] ειδικότερα σε ότι αφορά την απόδοση του φωτός ή την έμφαση στο χρώμα, παραμερίζοντας το βυζαντινό ιδίωμα και υιοθετώντας μία διαφορετική τεχνική[29] και 
      στοιχεία του μανιερισμού.[23]
</p>`;

document.getElementById('italy').addEventListener('click', function() {
    document.getElementById("main").innerHTML = italy;
});


let spain = `<p> Το 1577 καταγράφεται η παρουσία του Γκρέκο στην Ισπανία, χωρίς να διαθέτουμε πολλές πληροφορίες για τις δραστηριότητές του την περίοδο 1572-76 στην Ιταλία. Αρχικά εγκαταστάθηκε στη Μαδρίτη και αργότερα στο Τολέδο, πόλη που αποτελούσε τότε θρησκευτικό και πολιτικό κέντρο της Ισπανίας, με περίπου 62.000 κατοίκους το 1571.[30] Εκεί δημιούργησε ορισμένα από τα πιο γνωστά έργα της ώριμης περιόδου του και γνώρισε την καθιέρωση. Στις πρώτες παραγγελίες που ανέλαβε ανήκαν τρία ρετάμπλ για την εκκλησία του Αγίου Δομήνικου και ο πίνακας Ο Διαμερισμός των Ιματίων του Χριστού (1577-79) που μεταφέρθηκε στο σκευοφυλάκιο του καθεδρικού ναού της πόλης. Συμμετείχε επίσης στο εικονογραφικό πρόγραμμα για το Ανάκτορο του Εσκοριάλ, το οποίο υπήρξε ενδεχομένως και ο κύριος λόγος για τον οποίο εγκαταστάθηκε στην Ισπανία,[28] επιδιώκοντας να κερδίσει την εύνοια του βασιλιά. Ο Φίλιππος Β' της Ισπανίας επέλεξε αρχικά τον ζωγράφο Χουάν Φερνάντες δε Ναβαρέτε να διακοσμήσει την εκκλησία του Αγίου Λαυρεντίου, ωστόσο μετά τον θάνατό του, ανέθεσε το έργο στον Θεοτοκόπουλο. Εκείνος ολοκλήρωσε το έργο Το Μαρτύριο του Αγίου Μαυρίκιου (1580-82), το οποίο όμως δεν ικανοποίησε τον βασιλιά, με αποτέλεσμα να μην τοποθετηθεί στην εκκλησία του Εσκοριάλ, πιθανώς γιατί δεν ήταν συμβατός με το πνεύμα που επιζητούσε ο ίδιος να κυριαρχεί.[v] Το γεγονός πως δεν κατάφερε να αποτελέσει μέλος τής βασιλικής αυλής, οδήγησε τελικά στη σύσφιξη των σχέσεών του με την πόλη του Τολέδου. Ο Παραβιθίνο τόνισε τη στενή σχέση του με την ισπανική πόλη, σε ένα σονέτο που συνέθεσε το 1614 προς τιμή του Θεοτοκόπουλου, όπου αναφέρει πως «ζωή πήρε από την Κρήτη και χρωστήρες, πιο ωραία πατρίδα βρήκε στο Τολέδο, απ' όπου ξεκινά την αιωνιότητα να κατακτήσει διά του θανάτου».[31] Εκεί απέκτησε ένα γιο, τον Χόρχε Μανουέλ (Γεώργιος Εμμανουήλ), με τη Χερόνιμα ντε λας Κουέβας (Doña Jerónima de Las Cuevas).[vi] Συνεργάστηκε με αρκετούς παραγγελιοδότες, όπως τον μοναχό και καθηγητή ρητορικής Ορτένσιο Φέλιξ Παραβιθίνιο (1580-1633), τον νομομαθή Χερόνιμο δε Θεβάγιος (1562-1644) ή τον φίλο του και λόγιο της εποχής Αντόνιο δε Κοβαρούμπιας (1524-1602).

Το 1586, ο ιερέας της ενορίας του Αγίου Θωμά, του ανέθεσε την παραγγελία για τον πίνακα Η Ταφή του Κόμη Οργκάθ, που συνιστά μέχρι σήμερα ένα από τα δημοφιλέστερα έργα του. Στις σημαντικότερες παραγγελίες που ανέλαβε στο Τολέδο ανήκει επίσης ένα ρετάμπλ που φιλοτέχνησε για το Ίδρυμα της Doña María de Aragon στη Μαδρίτη, καθώς και η διακόσμηση του παρεκκλησίου του Αγίου Ιωσήφ (Capilla de San Jose), που προέβλεπε δύο θρησκευτικές συνθέσεις και δύο γλυπτά των Δαβίδ και Σολομώντα. Το εργαστήριο του γνώρισε μέγιστη ακμή κατά την περίοδο 1600-1607, ενώ συνεργάτης του υπήρξε από το 1597 και ο γιος του, το όνομα του οποίου αναφέρεται σε αρκετά έγγραφα της εποχής. Την περίοδο 1603-07, ο Χόρχε Μανουέλ ανέλαβε να φιλοτεχνήσει ορισμένα έργα που προορίζονταν για το νοσοκομείο Καριδάδ στο Ιγιέσκας, παραγγελία που οδήγησε τελικά σε μία οικονομική διαμάχη, καθώς οι παραγγελιοδότες δεν έμειναν ικανοποιημένοι από το αποτέλεσμα. Η τελευταία παραγγελία που ανέλαβε ο Θεοτοκόπουλος ήταν για το νοσοκομείο Ταβέρα του Τολέδου, για την οποία συνεργάστηκε με τον γιο του. Πέθανε στις 7 Απριλίου του 1614, πριν ολοκληρώσει το έργο και αρχικά θάφτηκε στην εκκλησία του Αγίου Δομήνικου στο Τολέδο. Το 1619, ο γιος του μετέφερε το λείψανό του στην εκκλησία του Σαν Τορκουάτο, η οποία αργότερα κατεδαφίστηκε με αποτέλεσμα να χαθεί το φέρετρό του. Στην απογραφή που συνέταξε ο γιος του μετά τον θάνατο του Γκρέκο, αναφέρονταν 143 ολοκληρωμένοι πίνακες, 45 γύψινα ή πήλινα προπλάσματα, 150 σχέδια, 30 σχέδια για ρετάμπλ καθώς και 200 χαρακτικά έργα.[32]</p>`

document.getElementById('spain').addEventListener('click', function() {
    document.getElementById("main").innerHTML = spain;
});

let death = `<p>Κατά τη διάρκεια της ζωής του, το έργο του εκτιμήθηκε και προωθήθηκε περισσότερο από τους λόγιους, 
ουμανιστές και διανοούμενους και λιγότερο από το καλλιτεχνικό κατεστημένο.[39] Αργότερα, αγνοήθηκε για μία περίοδο 
περίπου τετρακοσίων ετών. Δεν υπήρξαν μιμητές του, καθώς μόνο ο γιος του φρόντισε για την αναπαραγωγή ορισμένων 
από τις πιο γνωστές συνθέσεις του. Στη διάρκεια του 16ου και 17ου αιώνα, ο Γκρέκο τοποθετείτο στην Ιταλική σχολή, 
έχοντας τη φήμη ενός ζωγράφου με τάσεις εκκεντρικότητας, στην προσπάθειά του να πρωτοτυπήσει, 
αλλά και με περιφρόνηση απέναντι στους καθιερωμένους κανόνες.[16] Για αρκετούς ιστορικούς, η τέχνη του Γκρέκο συνδέθηκε 
με το πνεύμα της Αντιμεταρρύθμισης, θεώρηση που συγκρούεται ή συμπληρώνεται με άλλες ερμηνείες, κυρίως Ελλήνων μελετητών του,
 που τονίζουν τη σημασία των βυζαντινών στοιχείων στην τέχνη του. Άλλοι ερευνητές, με βάση τις γραπτές σημειώσεις του Γκρέκο,
 [vii] τονίζουν περισσότερο την εικόνα ενός ζωγράφου με φιλοσοφικές αναζητήσεις (συνδεόμενο ειδικότερα με τις νεοπλατωνικές ιδέες), 
 αποκομμένος από τα θρησκευτικά ζητήματα της εποχής και απασχολούμενος κυρίως με αισθητικά προβλήματα, σε σχέση με τη διερεύνηση και 
 απόδοση του φυσικού κόσμου μέσα από τη ζωγραφική.[16] Η τέχνη του Θεοτοκόπουλου ήταν αρκετά προσωπική και αυτόνομη, έτσι ώστε να μην 
 ευνοηθεί η «συνέχειά» της, ενώ καθοριστικό ρόλο σε αυτό διαδραμάτισε και η νέα μπαρόκ τεχνοτροπία που εκτόπισε τον μανιερισμό του 16ου αιώνα, 
 με αποτέλεσμα το έργο του Γκρέκο να είναι ελάχιστα γνωστό κατά την περίοδο του μπαρόκ. Στη διάρκεια του 17ου αιώνα, υπό την άνθιση του 
 κλασικισμού, και στις αρχές του 18ου, οι πίνακές του θεωρούνταν «υπερβολικοί» και «επιτηδευμένοι»,[39] ενώ η εκκεντρικότητά του συχνά ταυτίστηκε
  με ενδεχόμενη «παραφροσύνη».[16] Αργότερα, κατά την περίοδο του ρομαντισμού, τα έργα του επανεξετάστηκαν. Για τον Γάλλο ποιητή Θεόφιλο Γκωτιέ – έναν
   από τους πρώτους που εξέφρασαν θαυμασμό για το ύστερο έργο του Γκρέκο – θεωρήθηκε πρόγονος του ρομαντικού κινήματος στην αναζήτηση του παράδοξου ή του ακραίου. 
   Οι κριτικοί τέχνης Ζακαρί Αστρύκ και Πολ Λεφόρ, συνέβαλαν επίσης στην προώθηση ενός νέου ενδιαφέροντος για τον Θεοτοκόπουλο, την ίδια στιγμή που Ισπανοί
    ζωγράφοι στο Παρίσι υιοθετούσαν την τεχνοτροπία του.[40] Από τους πρωταγωνιστές αυτής της τάσης υπήρξε ο Ιγνάσιο Θουλοάγα (1870-1945), καλλιτέχνης βασκικής καταγωγής, 
    ο οποίος αντέγραφε έργα του Γκρέκο που βρίσκονταν στο Πράδο.[39] Στην Ισπανία, εκπρόσωποι του ιμπρεσιονισμού και του συμβολισμού, ανανέωσαν το ενδιαφέρον για το έργο του Γκρέκο,
     το οποίο ερμήνευσαν ως προδρομικό εκείνου του Βελάσκεθ. Το 1908 ολοκληρώθηκε ο πρώτος αναλυτικός κατάλογος έργων του, από τον Ισπανό ιστορικό τέχνης Μανουέλ Μπαρτολομέ Κοσίο.
      Με την άνθιση του εξπρεσιονισμού κατά τις αρχές του 20ού αιώνα, το έργο του Γκρέκο θεωρήθηκε προδρομικό του ρεύματος αυτού και σταδιακά επανεξετάστηκε
       αποκτώντας τελικά την εξέχουσα θέση που διατηρεί ως σήμερα στην ιστορία της τέχνης. Ο ιστορικός και κριτικός τέχνης Ιούλιος Μάγιερ-Γκρέφε,
        κατέγραψε τις εντυπώσεις του από το έργο του Γκρέκο, κατά την επίσκεψή του στην Ισπανία το 1909, αναγνωρίζοντας σε αυτό μοντέρνα στοιχεία.[41] 
        Την ίδια αντίληψη εξέφρασε και ο κριτικός Ρότζερ Φράι, θεωρώντας τον Γκρέκο «όχι μόνο μοντέρνο, αλλά αρκετά βήματα μπροστά».[42] 
        Στις αρχές του 20ου αιώνα, υποστηρίχθηκε πως το ύφος που χαρακτηρίζει τα έργα της ύστερης περιόδου του ήταν αποτέλεσμα αστιγματισμού από τον οποίο έπασχε, 
        άποψη που είναι μάλλον εσφαλμένη.[viii]
</p>`
document.getElementById('death').addEventListener('click', function() {
    document.getElementById("main").innerHTML = death;
});

document.getElementById("biobutton").addEventListener('click', function() {
    document.getElementById("pinakes").setAttribute("style", "display: none;");

    document.getElementById("biography").setAttribute("style", "display: block;");
});





document.getElementById("pinakesbutton").addEventListener('click', function() {
    document.getElementById("pinakes").setAttribute("style", "display: block;");
    document.getElementById("biography").setAttribute("style", "display: none   ;");

});


let agiografies = `   
            <div>
                <div class="flex">
                <div><img src="pinakes/agiaikogenia.jpeg"></div>
                <div><img src="pinakes/agiatriada.jpeg"></div>
                <div> <img src="pinakes/agioiandreaskaifragkiskos.jpeg"></div>
                <div> <img src="pinakes/agiosindefonsos.jpeg"></div>
                <div> <img src="pinakes/agiosloudovikos.jpeg"></div>
                <div> <img src="pinakes/agiospetros.jpeg"></div>
                <div> <img src="pinakes/agiospetroskaipaulos.jpeg"></div>
                <div> <img src="pinakes/agiossevastianos.jpeg"></div>
                <div> <img src="pinakes/panagiatoueleous.jpeg"></div>
                <div> <img src="pinakes/oagiosmartinoskaizhtianos.jpeg"></div>
                <div><img src="pinakes/saintfrancis.jpeg"></div>
                <div><img src="pinakes/saintveronica.jpeg"></div>
                <div><img src="pinakes/magdalhnh.jpeg"></div>
            </div>`

document.getElementById("Agiografies").addEventListener('click', function() {

    document.getElementById("main").innerHTML = agiografies;
});

let portreta = `
            <div>
                <div class="flex">

                <div><img src="pinakes/portraitofgentleman.jpeg"</div>
                <div><img src="pinakes/portrerokardinalioufernanto.jpeg"</div>
                <div><img src="pinakes/portretoandros.jpeg"</div>
                <div><img src="pinakes/portretotouxorxe.jpeg"</div>

                </div>
            </div>
    
`

document.getElementById("Portreta").addEventListener('click', function() {
    document.getElementById("main").innerHTML = portreta;
});


let others = `
    <div>
        <div class="flex">

        <div><img src="pinakes/annuciation.jpeg"</div>
        <div><img src="pinakes/apokathilosi.jpeg"</div>
        <div><img src="pinakes/apopsikaixarths.jpeg"</div>
        <div><img src="pinakes/apopsitoutoledou.jpeg"</div>
        <div><img src="pinakes/christhealingtheblind.jpeg"</div>
        <div><img src="pinakes/deipnossimwnos.jpeg"</div>
        <div><img src="pinakes/ecstasyfrancisofassisi.jpeg"</div>
        <div><img src="pinakes/ekdioksitwnemporwn.jpeg"</div>
        <div><img src="pinakes/ekstashagioufragkiskou.jpeg"</div>
        <div><img src="pinakes/epimetheusandpandora.jpeg"</div>
        <div><img src="pinakes/euaggelismos.jpeg"</div>
        <div><img src="pinakes/hpempthsfragida.jpeg"</div>
        <div><img src="pinakes/hproskynhshtwnpoimenwn.jpeg"</div>
        <div><img src="pinakes/koimisithspanagias.jpeg"</div>
        <div><img src="pinakes/koimisithstheotokou.jpeg"</div>
        <div><img src="pinakes/paidipoufysaei.jpeg"</div>

        </div>
    </div>
`


document.getElementById("other").addEventListener('click', function() {
    document.getElementById("main").innerHTML = others;

});